000000 IDENTIFICATION DIVISION.
000100     PROGRAM-ID. FIZZ-BUZZ.
000150*    LISTS 1-100 PRINTS FIZZ FOR MULTS OF 3 AND BUZZ FOR MULTS OF 5.
000200 DATA DIVISION.
000250     WORKING-STORAGE SECTION.
000300     01 i PIC 9(3) VALUE 1.
000350*    THIS IS A VARIABLE FOR A LOOP.
000400     01 JUNK PIC 9.
000450*    THIS IS WHAT WILL BE GIVEN.
000500     01 REMAIN PIC 9.
000550*    THIS IS THE REMAINDER.
000600 PROCEDURE DIVISION.
000700     PARA-MAIN.
000800         PERFORM PARA-FIZZER VARYING i FROM 1 BY 1 UNTIL i=101.
000900     STOP RUN.
000950
001000     PARA-FIZZER.
001100         DIVIDE i BY 3 GIVING JUNK REMAINDER REMAIN.
001200         IF REMAIN=0 THEN
001300            DIVIDE i BY 5 GIVING JUNK REMAINDER REMAIN
001400            IF REMAIN=0 THEN
001500               DISPLAY "FIZZ BUZZ"
001550            ELSE
001600               DISPLAY "FIZZ"
001700            END-IF
001750         ELSE
001800            DIVIDE i BY 5 GIVING JUNK REMAINDER REMAIN
001900            IF REMAIN=0 THEN
002000               DISPLAY "BUZZ"
002050             ELSE
002100                 DISPLAY i
002200            END-IF
002300        END-IF.
