000000 IDENTIFICATION DIVISION.
000010    PROGRAM-ID. HELLO-WORLD.
000020 DATA DIVISION.
000030     WORKING-STORAGE SECTION.
000040     01 HEY PIC X(13) VALUE 'HELLO WORLD'.
000040 PROCEDURE DIVISION.
000050     DISPLAY HEY.
000060     STOP RUN.
